OdDAI.ADB_Value.clean
\details
Clears attribute data block.

OdDAI.ADB_Value.getValue(OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value of the attribute data block, represented as an OdAnsiString object.
The method fills the passed parameter with the attribute data block value and returns it to a calling subroutine.
\param getTo [out] A placeholder for the OdAnsiString object that contains the value of the attribute data block.
\returns true if the attribute data block value was successfully converted and returned to the calling subroutine; otherwise, the method returns false.

OdDAI.ADB_Value.getValue(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value of the attribute data block, represented as an array of bytes.
The method fills the passed parameter with the attribute data block value and returns it to a calling subroutine.
\param getTo [out] A placeholder for the raw pointer to the array of bytes that contains the value of the attribute data block.
\returns true if the attribute data block value was successfully converted and returned to the calling subroutine; otherwise, the method returns false.

OdDAI.ADB_Value.getValue(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value of the attribute data block, represented as a double value.
The method fills the passed parameter with the attribute data block value and returns it to a calling subroutine.
\param getTo [out] A placeholder for the double value that contains the value of the attribute data block.
\returns true if the attribute data block value was successfully converted and returned to the calling subroutine; otherwise, the method returns false.

OdDAI.ADB_Value.getValue(System.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value of the attribute data block, represented as a boolean value.
The method fills the passed parameter with the attribute data block value and returns it to a calling subroutine.
\param getTo [out] A placeholder for the boolean value that contains the value of the attribute data block.
\returns true if the attribute data block value was successfully converted and returned to the calling subroutine; otherwise, the method returns false.

OdDAI.ADB_Value.getValue(System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value of the attribute data block, represented as a signed integer value.
The method fills the passed parameter with the attribute data block value and returns it to a calling subroutine.
\param getTo [out] A placeholder for the signed integer value that contains the value of the attribute data block.
\returns true if the attribute data block value was successfully converted and returned to the calling subroutine; otherwise, the method returns false.

OdDAI.ADB_Value.setValue(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the new value of the attribute data block, represented with an OdAnsiString value.
\param setFrom [in] An OdAnsiString object that contains the new value of the attribute data block object.
\returns true if the new value was successfully set; otherwise, the method returns false.

OdDAI.ADB_Value.setValue(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Sets the new value of the attribute data block, represented with a raw pointer to an array of bytes.
\param setFrom [in] A raw pointer to the array of bytes that contains the new value of the attribute data block object.
\returns true if the new value was successfully set; otherwise, the method returns false.

OdDAI.ADB_Value.setValue(System.Double!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the new value of the attribute data block, represented with a double value.
\param setFrom [in] A double value that contains the new value of the attribute data block object.
\returns true if the new value was successfully set; otherwise, the method returns false.

OdDAI.ADB_Value.setValue(System.Boolean!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the new value of the attribute data block, represented with a boolean value.
\param setFrom [in] A boolean value that contains the new value of the attribute data block object.
\returns true if the new value was successfully set; otherwise, the method returns false.

OdDAI.ADB_Value.setValue(System.Int32!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the new value of the attribute data block, represented with a signed integer value.
\param setFrom [in] A signed integer value that contains the new value of the attribute data block object.
\returns true if the new value was successfully set; otherwise, the method returns false.

OdDAI.ADB_Value.op_Equality(OdDAI.ADB_Value!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The comparison operator for attribute data block values.
\param rightValue [in] Another attribute data block value to compare.
\returns true if values are equal; otherwise, the operator returns false.

OdDAI.ADB_Value.op_Assign(OdDAI.ADB_Value!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The assignment operator for attribute data block values.
\param rightValue [in] Another attribute data block value to assign (right-hand operand of the assignment operation).
\returns A reference to the attribute data block value modified with the assignment operator.

OdDAI.ADB_Value.Dispose
\details
Destroys the attribute data block value.

OdDAI.ADB_Value.#ctor(OdDAI.ADB_Value!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new instance of the attribute data block as a copy of another instance (copy constructor).
\param rightValue [in] The value to copy from.

OdDAI.ADB_Value.#ctor
\details
Creates a new empty instance of the attribute data block.

OdDAI.ADB_Value
\details
A class that implements storing and handling a value of the SELECT data type represented as an attribute data block.